pmo-dataset/variations/graphviz_with_ids/08.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Propose corrective\nactions"];
  "Task_2" [label="Log report into\ntracking system"];
  "Task_3" [label="Close incident\nreport"];
  "Task_4" [label="Change policy"];
  "Task_5" [label="Assign report to\nappropriate team"];
  "Task_6" [label="Report incident"];
  "Task_7" [label="Conduct training"];
  "Task_8" [label="Gather necessary\ninformation"];
  "Task_9" [label="Identify cause of\nincident"];
  "Task_10" [label="Notify all\nstakeholders"];
  "Task_11" [label="Implement fix"];
  "Task_12" [label="Conduct follow-up"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "Task_4" -> "ExclusiveGateway_1";
  "ExclusiveGateway_2" -> "Task_11";
  "ExclusiveGateway_1" -> "Task_12";
  "StartNoneEvent_1" -> "Task_6";
  "ParallelGateway_1" -> "Task_1";
  "Task_8" -> "ParallelGateway_1";
  "Task_2" -> "Task_5";
  "ParallelGateway_2" -> "Task_8";
  "Task_12" -> "Task_3";
  "Task_10" -> "EndNoneEvent_1";
  "ExclusiveGateway_2" -> "Task_4";
  "Task_9" -> "ParallelGateway_1";
  "Task_3" -> "Task_10";
  "Task_11" -> "ExclusiveGateway_1";
  "Task_6" -> "Task_2";
  "Task_1" -> "ExclusiveGateway_2";
  "Task_7" -> "ExclusiveGateway_1";
  "Task_5" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Task_9";
  "ExclusiveGateway_2" -> "Task_7";
}
